index.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil _:nil arch:headline author:nil
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:nil e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:nil tex:t timestamp:nil title:nil toc:3 todo:nil |:t
#+TITLE: BattleSnake 2017 API
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+OPTIONS: gid:nil html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t tex:t toc-tag:nil
#+OPTIONS: toc-todo:nil whn:t
#+HTML_CONTAINER: div
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/1.11.3/jquery.min.js"></script>
#+HTML_HEAD: <link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/js/bootstrap.min.js"></script>
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 9.0.3)
#+STARTUP: content

# run ./scripts/org-server to start the org-server node from the battle snake project root.
# required to regenerate code blocks.
#+BEGIN_SRC elixir :remsh org-server@localhost :sname org-console :exports none
Node.self()
#+END_SRC

#+RESULTS:
: :"org-server@localhost"

#+BEGIN_EXPORT html
<style>
</style>
#+END_EXPORT

* Introduction
Like previous years, all competing clients are expected to provide a web
application that is available at a routeable URL.

Clients are expected to respond to HTTP requests and provide a route for [[#post-start][POST /start]] and [[#post-move][POST /move]].

# FIXME: decide what happends on timeout
All clients are expected to respond within 200ms of the server's initial
request. Failing to respond before the timemout may result in the server
choosing a random move for you.

All responses are expected to have a =200 OK= status code.

* Callbacks
** =POST /start=
   :PROPERTIES:
   :CUSTOM_ID: post-start
   :END:

   Called when a new game is started.

   Game IDs are guaranteed to be unique[fn:2].

   The purpose of this callback is for clients to report what their snake's
   name, colour, and other display properties should be for this game.

   This callback should not be used to manage internal snake state it is not
   guaranteed that as you will be notified when the game ends, or when your
   snake dies.

   All attributes the request are provided to maintain backwards compatibility
   with 2015 snake clients - it is *strongly* recommend that clients exclusively
   use the [[#post-move][move callback]] for any and all game play logic.

   | *URL*     | /start                         |
   | *Method*  | POST                           |
   | *Headers* | Content-Type: application-json |

*** Request attributes
    | Attribute | Type    |
    |-----------+---------|
    | <l>       | <l>     |
    | *game_id* | UUID    |
    | *height*  | integer |
    | *width*   | integer |
    |-----------+---------|
*** Example Request
    #+BEGIN_SRC elixir :remsh org-server@localhost :sname org-console :wrap "SRC js" :eval no-export :exports results :cache yes
      alias BattleSnake.{GameForm}

      %GameForm{
        id: Ecto.UUID.generate()
      }
      |> Poison.encode!(pretty: true)
      |> IO.puts
    #+END_SRC

    #+RESULTS[6084a51ad554b37393dec1e7191d16ed6861537b]:
    #+BEGIN_SRC js
    {
      "width": 20,
      "height": 20,
      "game_id": "b1dadee8-a112-4e0e-afa2-2845cd1f21aa"
    }
    :ok
    #+END_SRC

*** Response Attributes
    | Attribute  |            | Type   |                                                                   |
    |------------+------------+--------+-------------------------------------------------------------------|
    | *color*    |            | string | A valid css color. HSL, RBG, hex, or named colours are all valid. |
    | *head_url* | /optional/ | url    | Url of an image to use for the head of your snake.                |
    | *name*     |            | string | Your snake's name.                                                |
    | *taunt*    | /optional/ | string | Message to display in the game client.                            |

*** Example Response
    - Code: =200 OK=
    - Content:
    #+BEGIN_SRC js
    {
          "color": "#FF0000",
          "head_url": "http://placecage.com/c/100/100",
          "name": "Cage Snake",
          "taunt": "OH GOD NOT THE BEES"
      }
    #+END_SRC
*** Sample call
    #+BEGIN_SRC sh :results verbatim replace :exports both :cache yes :eval no-export :wrap "SRC js"
      my_snake_server_url="localhost:4000/test-snake"

      curl $my_snake_server_url/start \
           -X POST \
           -H "Content-Type: application/json" \
           --data @- <<-REQUEST_BODY
      {"width":20,"height":20,"game_id":"example-game-id"}
       REQUEST_BODY
    #+END_SRC

    #+RESULTS[53c4397691891d18ff67e7ffb1486a598d7ffd8f]:
    #+BEGIN_SRC js
    {"name":"test-snake","color":"#123123"}
    #+END_SRC

** =POST /move=
   :PROPERTIES:
   :CUSTOM_ID: post-move
   :END:
   The game server will issue a request for this callback on each turn to
   request the client's move.

   This callback should be used for all game logic.

   | *URL*     | /start                         |
   | *Method*  | POST                           |
   | *Headers* | Content-Type: application-json |

*** Request Attributes
    | Attribute | Type                    |                                                                                                                                                                                                                     |
    |-----------+-------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
    | <l>       | <l>                     |                                                                                                                                                                                                                     |
    | *board*   | Array<Array<[[#type-board-cell][BoardCell]]>> | Two dimensional representation of the board. It's not recommeded that you use this for game logic, instead consider using =food=, =snakes=, =you=, =width= and =height=. This is mostly for backward compatibility. |
    | *food*    | Array<[[#type-point][Point]]>            | Array of all food currently on the board                                                                                                                                                                            |
    | *game_id* | UUID                    |                                                                                                                                                                                                                     |
    | *height*  | integer                 |                                                                                                                                                                                                                     |
    | *snakes*  | Array<[[#type-snake][Snake]]>            | Array of all living snakes in the game                                                                                                                                                                              |
    | *turn*    | integer                 | The current turn.                                                                                                                                                                                                   |
    | *width*   | integer                 |                                                                                                                                                                                                                     |
    | *you*     | UUID                    | A reference to your snake's id, the snake object can be found in =snakes=.                                                                                                                                          |
    |-----------+-------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|

