index.html
<!doctype html>
<html lang="en">
<head>
<title>BattleSnake 2017 API</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">BattleSnake 2017 API</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Like previous years, all competing clients are expected to provide a web
application that is available at a routeable URL.
</p>

<p>
Clients are expected to respond to HTTP requests and provide a route for <a href="#post-start">POST /start</a> and <a href="#post-move">POST /move</a>.
</p>

<p>
All clients are expected to respond within 200ms of the server's initial
request. Failing to respond before the timemout may result in the server
choosing a random move for you.
</p>

<p>
All responses are expected to have a <code>200 OK</code> status code.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Callbacks</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-post-start" class="outline-3">
<h3 id="post-start"><a id="sec-2-1" name="sec-2-1"></a><span class="section-number-3">2.1</span> <code>POST /start</code></h3>
<div class="outline-text-3" id="text-post-start">
<p>
Called when a new game is started.
</p>

<p>
Game IDs are guaranteed to be unique.
</p>

<p>
The purpose of this callback is for clients to report what their snake's
name, colour, and other display properties should be for this game.
</p>

<p>
This callback should not be used to manage internal snake state it is not
guaranteed that as you will be notified when the game ends, or when your
snake dies.
</p>

<p>
All attributes the request are provided to maintain backwards compatibility
with 2015 snake clients - it is <b>strongly</b> recommend that clients exclusively
use the <a href="#post-move">move callback</a> for any and all game play logic.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> URL</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<code>/start</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Method</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<code>POST</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Headers</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<code>Content-Type: application/json</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Example Request</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span>
  <span style="color: #2aa198;">"width"</span>: <span style="color: #6c71c4;">20</span>,
  <span style="color: #2aa198;">"height"</span>: <span style="color: #6c71c4;">20</span>,
  <span style="color: #2aa198;">"game_id"</span>: <span style="color: #2aa198;">"a7ee8ceb-5c82-4513-a6fe-7a1f86c160f7"</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Example Response</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>Code: <code>200 OK</code>
</li>
<li>Content:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span>
      <span style="color: #2aa198;">"color"</span>: <span style="color: #2aa198;">"#FF0000"</span>,
      <span style="color: #2aa198;">"head_url"</span>: <span style="color: #2aa198;">"http://placecage.com/c/100/100"</span>,
      <span style="color: #2aa198;">"name"</span>: <span style="color: #2aa198;">"Cage Snake"</span>,
      <span style="color: #2aa198;">"taunt"</span>: <span style="color: #2aa198;">"OH GOD NOT THE BEES"</span>
  <span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> Sample call</h4>
<div class="outline-text-4" id="text-2-1-6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #268bd2;">my_snake_server_url</span>=<span style="color: #2aa198;">"localhost:4000/test-snake"</span>

curl $<span style="color: #268bd2;">my_snake_server_url</span>/start <span style="color: #b58900; font-weight: bold;">\</span>
     -X POST <span style="color: #b58900; font-weight: bold;">\</span>
     -H <span style="color: #2aa198;">"Content-Type: application/json"</span> <span style="color: #b58900; font-weight: bold;">\</span>
     --data @- &lt;&lt;-REQUEST_BODY
<span style="color: #b58900; font-weight: bold;">{"width":20,"height":20,"game_id":"example-game-id"}</span>
<span style="color: #b58900; font-weight: bold;"> REQUEST_BODY</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span><span style="color: #2aa198;">"name"</span>:<span style="color: #2aa198;">"test-snake"</span>,<span style="color: #2aa198;">"color"</span>:<span style="color: #2aa198;">"#123123"</span><span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> Notes</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
Requests timeout after 200ms, failing to respond will do something.
</p>
</div>
</div>
</div>
<div id="outline-container-post-move" class="outline-3">
<h3 id="post-move"><a id="sec-2-2" name="sec-2-2"></a><span class="section-number-3">2.2</span> <code>POST /move</code></h3>
<div class="outline-text-3" id="text-post-move">
<p>
The game server will issue a request for this callback on each turn to
request the client's move.
</p>

<p>
This callback should be used for all game logic
</p>
</div>
