index.org
*** Example Request
    #+BEGIN_SRC elixir :remsh org-server@localhost :sname org-console :wrap "SRC js" :eval no-export :exports results :cache yes :results value
      alias BattleSnake.{
        Snake,
        World,
      }

      use BattleSnake.Point

      my_snake = %Snake{
        coords: [p(0, 0), p(0, 0), p(0, 0)],
        health_points: 93,
        id: Ecto.UUID.generate(),
        name: "my-snake",
        taunt: "git gud",
        url: "localhost:4000",
      }

      other_snake = %Snake{
        coords: [p(1, 0), p(1, 0), p(1, 0)],
        health_points: 50,
        id: Ecto.UUID.generate(),
        name: "other-snake",
        taunt: "gotta go fast",
        url: "localhost:4001",
      }

      food = [p(1,1)]

      snakes = [my_snake, other_snake]

      %World{
        width: 2,
        height: 2,
        snakes: snakes,
        food: food,
        game_id: Ecto.UUID.generate(),
      }
      |> Poison.encode!(pretty: true, me: my_snake.id)
      |> IO.puts
    #+END_SRC

    #+RESULTS[e909af054857d10965dd9905fdf8433dcd44ba75]:
    #+BEGIN_SRC js
    {
      "you": "5b079dcd-0494-4afd-a08e-72c9a7c2d983",
      "width": 2,
      "turn": 0,
      "snakes": [
        {
          "taunt": "git gud",
          "name": "my-snake",
          "id": "5b079dcd-0494-4afd-a08e-72c9a7c2d983",
          "health_points": 93,
          "coords": [
            [
              0,
              0
            ],
            [
              0,
              0
            ],
            [
              0,
              0
            ]
          ]
        },
        {
          "taunt": "gotta go fast",
          "name": "other-snake",
          "id": "9116ef2a-51c1-4fb5-9b3f-b5d3fbfcbef6",
          "health_points": 50,
          "coords": [
            [
              1,
              0
            ],
            [
              1,
              0
            ],
            [
              1,
              0
            ]
          ]
        }
      ],
      "height": 2,
      "game_id": "aecf53b9-c7f2-4f5d-bc3f-cd14cb8338f0",
      "food": [
        [
          1,
          1
        ]
      ],
      "board": [
        [
          {
            "state": "head",
            "snake": "my-snake"
          },
          {
            "state": "empty"
          }
        ],
        [
          {
            "state": "head",
            "snake": "other-snake"
          },
          {
            "state": "food"
          }
        ]
      ]
    }
    :ok
    #+END_SRC

***  Response Attributes
    | Attribute |            | Type                                         |
    |-----------+------------+----------------------------------------------|
    | *move*    | *required* | "up" \vert "left" \vert "down" \vert "right" |
    | *taunt*   | /optional/ | string                                       |
    |-----------+------------+----------------------------------------------|

*** Example Response
    - Code: =200 OK=
    - Content:
    #+BEGIN_SRC js
      {
          "move": "up",
          "taunt": "gotta go fast"
      }
    #+END_SRC
*** Sample call
    #+BEGIN_SRC sh :results verbatim replace :exports both :cache yes :eval no-export :wrap "SRC js"
      my_snake_server_url="localhost:4000/test-snake"

      curl $my_snake_server_url/move \
           -X POST \
           -H "Content-Type: application/json" \
           --data @- <<-REQUEST_BODY
         {{"you": {"name": "my-snake", "coords": [[0, 0], [0, 0], [0, 0]]},
         "turn": 0, "snakes": [{"name": "my-snake", "coords": [[0, 0], [0, 0],
         [0, 0]]}], "game_id": 0, "food": [[0, 1]], "board": [[{"state": "head",
         "snake": "my-snake"}, {"state": "food"}], [{"state": "empty"},
         {"state": "empty"}]]}
         REQUEST_BODY
    #+END_SRC

    #+RESULTS[5daf13e98697255d552f68e3d7fbe143f00821f5]:
    #+BEGIN_SRC js
    {"move":"right"}
    #+END_SRC


*** Notes
    Requests timeout after 200ms, failing to respond will result in the server
    choosing a move for you.
** Simple Example Snake
   Below is a simple example snake. This is what the bare minimum implementation
   of a /functional/ snake might look like.

   This example is written in Ruby, but you are of course not limited in what
   technology you wish to use.

   In the below example we create a basic Sinatra[fn:1] web application. The app
   severs the two post callbacks, and provides a response containing only the
   required attributes for both.

   #+BEGIN_SRC ruby
     # ./Gemfile
     source "https://rubygems.org"
     gem "sinatra", require: "sinatra/base"
     gem "rack"

     # ./ruby_snake.rb
     require "json"

     class RubySnake < Sinatra::Base
       post "/start" do
         {
           name: "simple-ruby-example-snake",
           color: "#123456"
         }.to_json
       end

       post "/move" do
         {
           move: "up"
         }.to_json
       end
     end
   #+END_SRC

   This Snake only goes up, but it works!


