index.html

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> URL</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<code>/move</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Method</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<code>POST</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Headers</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
<code>Content-Type: application/json</code>
</p>
</div>
</div>
<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Example Request</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span>
  <span style="color: #2aa198;">"you"</span>: <span style="color: #b58900;">{</span>
    <span style="color: #2aa198;">"url"</span>: <span style="color: #2aa198;">"localhost:4000"</span>,
    <span style="color: #2aa198;">"name"</span>: <span style="color: #2aa198;">"my-snake"</span>,
    <span style="color: #2aa198;">"coords"</span>: <span style="color: #268bd2;">[</span>
      <span style="color: #6c71c4;">[</span>
        <span style="color: #6c71c4;">0</span>,
        <span style="color: #6c71c4;">0</span>
      <span style="color: #6c71c4;">]</span>,
      <span style="color: #6c71c4;">[</span>
        <span style="color: #6c71c4;">0</span>,
        <span style="color: #6c71c4;">0</span>
      <span style="color: #6c71c4;">]</span>,
      <span style="color: #6c71c4;">[</span>
        <span style="color: #6c71c4;">0</span>,
        <span style="color: #6c71c4;">0</span>
      <span style="color: #6c71c4;">]</span>
    <span style="color: #268bd2;">]</span>
  <span style="color: #b58900;">}</span>,
  <span style="color: #2aa198;">"turn"</span>: <span style="color: #6c71c4;">0</span>,
  <span style="color: #2aa198;">"snakes"</span>: <span style="color: #b58900;">[</span>
    <span style="color: #268bd2;">{</span>
      <span style="color: #2aa198;">"url"</span>: <span style="color: #2aa198;">"localhost:4000"</span>,
      <span style="color: #2aa198;">"name"</span>: <span style="color: #2aa198;">"my-snake"</span>,
      <span style="color: #2aa198;">"coords"</span>: <span style="color: #6c71c4;">[</span>
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">0</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>,
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">0</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>,
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">0</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>
      <span style="color: #6c71c4;">]</span>
    <span style="color: #268bd2;">}</span>,
    <span style="color: #268bd2;">{</span>
      <span style="color: #2aa198;">"url"</span>: <span style="color: #2aa198;">"localhost:4001"</span>,
      <span style="color: #2aa198;">"name"</span>: <span style="color: #2aa198;">"other-snake"</span>,
      <span style="color: #2aa198;">"coords"</span>: <span style="color: #6c71c4;">[</span>
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">1</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>,
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">1</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>,
        <span style="color: #859900;">[</span>
          <span style="color: #6c71c4;">1</span>,
          <span style="color: #6c71c4;">0</span>
        <span style="color: #859900;">]</span>
      <span style="color: #6c71c4;">]</span>
    <span style="color: #268bd2;">}</span>
  <span style="color: #b58900;">]</span>,
  <span style="color: #2aa198;">"game_id"</span>: <span style="color: #2aa198;">"754c44c0-40bb-41d6-854a-e3d2083277fa"</span>,
  <span style="color: #2aa198;">"food"</span>: <span style="color: #b58900;">[</span>
    <span style="color: #268bd2;">[</span>
      <span style="color: #6c71c4;">1</span>,
      <span style="color: #6c71c4;">1</span>
    <span style="color: #268bd2;">]</span>
  <span style="color: #b58900;">]</span>,
  <span style="color: #2aa198;">"board"</span>: <span style="color: #b58900;">[</span>
    <span style="color: #268bd2;">[</span>
      <span style="color: #6c71c4;">{</span>
        <span style="color: #2aa198;">"state"</span>: <span style="color: #2aa198;">"head"</span>,
        <span style="color: #2aa198;">"snake"</span>: <span style="color: #2aa198;">"my-snake"</span>
      <span style="color: #6c71c4;">}</span>,
      <span style="color: #6c71c4;">{</span>
        <span style="color: #2aa198;">"state"</span>: <span style="color: #2aa198;">"empty"</span>
      <span style="color: #6c71c4;">}</span>
    <span style="color: #268bd2;">]</span>,
    <span style="color: #268bd2;">[</span>
      <span style="color: #6c71c4;">{</span>
        <span style="color: #2aa198;">"state"</span>: <span style="color: #2aa198;">"head"</span>,
        <span style="color: #2aa198;">"snake"</span>: <span style="color: #2aa198;">"other-snake"</span>
      <span style="color: #6c71c4;">}</span>,
      <span style="color: #6c71c4;">{</span>
        <span style="color: #2aa198;">"state"</span>: <span style="color: #2aa198;">"food"</span>
      <span style="color: #6c71c4;">}</span>
    <span style="color: #268bd2;">]</span>
  <span style="color: #b58900;">]</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Example Response</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>Code: <code>200 OK</code>
</li>
<li>Content:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span>
    <span style="color: #2aa198;">"move"</span>: <span style="color: #2aa198;">"up"</span>,
    <span style="color: #2aa198;">"taunt"</span>: <span style="color: #2aa198;">"gotta go fast"</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Sample call</h4>
<div class="outline-text-4" id="text-2-2-6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #268bd2;">my_snake_server_url</span>=<span style="color: #2aa198;">"localhost:4000/test-snake"</span>

curl $<span style="color: #268bd2;">my_snake_server_url</span>/move <span style="color: #b58900; font-weight: bold;">\</span>
     -X POST <span style="color: #b58900; font-weight: bold;">\</span>
     -H <span style="color: #2aa198;">"Content-Type: application/json"</span> <span style="color: #b58900; font-weight: bold;">\</span>
     --data @- &lt;&lt;-REQUEST_BODY
<span style="color: #b58900; font-weight: bold;">   {{"you": {"name": "my-snake", "coords": [[0, 0], [0, 0], [0, 0]]},</span>
<span style="color: #b58900; font-weight: bold;">   "turn": 0, "snakes": [{"name": "my-snake", "coords": [[0, 0], [0, 0],</span>
<span style="color: #b58900; font-weight: bold;">   [0, 0]]}], "game_id": 0, "food": [[0, 1]], "board": [[{"state": "head",</span>
<span style="color: #b58900; font-weight: bold;">   "snake": "my-snake"}, {"state": "food"}], [{"state": "empty"},</span>
<span style="color: #b58900; font-weight: bold;">   {"state": "empty"}]]}</span>
<span style="color: #b58900; font-weight: bold;">   REQUEST_BODY</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #2aa198;">{</span><span style="color: #2aa198;">"move"</span>:<span style="color: #2aa198;">"right"</span><span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> Notes</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
Requests timeout after 200ms, failing to respond will result in the server
choosing a move for you.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Simple Example Snake</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Below is a simple example snake. This is what the bare minimum implementation
of a <i>functional</i> snake might look like.
</p>

<p>
In the below example we create a basic Sinatra<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> web application. The app
severs the two post callbacks, and provides a response containing only the
required attributes for both.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #586e75;"># </span><span style="color: #586e75;">./Gemfile</span>
source <span style="color: #2aa198;">"https://rubygems.org"</span>
gem <span style="color: #2aa198;">"sinatra"</span>, <span style="color: #268bd2; font-weight: bold;">require</span>: <span style="color: #2aa198;">"sinatra/base"</span>
gem <span style="color: #2aa198;">"rack"</span>

<span style="color: #586e75;"># </span><span style="color: #586e75;">./ruby_snake.rb</span>
<span style="color: #839496; font-weight: bold;">require</span> <span style="color: #2aa198;">"json"</span>

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">RubySnake</span> &lt; <span style="color: #b58900;">Sinatra</span>::<span style="color: #b58900;">Base</span>
  post <span style="color: #2aa198;">"/start"</span> <span style="color: #859900; font-weight: bold;">do</span>
    <span style="color: #2aa198;">{</span>
      <span style="color: #268bd2; font-weight: bold;">name</span>: <span style="color: #2aa198;">"simple-ruby-example-snake"</span>,
      <span style="color: #268bd2; font-weight: bold;">color</span>: <span style="color: #2aa198;">"#123456"</span>
    <span style="color: #2aa198;">}</span>.to_json
  <span style="color: #859900; font-weight: bold;">end</span>

  post <span style="color: #2aa198;">"/move"</span> <span style="color: #859900; font-weight: bold;">do</span>
    <span style="color: #2aa198;">{</span>
      <span style="color: #268bd2; font-weight: bold;">move</span>: <span style="color: #2aa198;">"up"</span>
    <span style="color: #2aa198;">}</span>.to_json
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<p>
This Snake only goes up, but it works!
</p>
</div>
</div>
</div>
