index.org
* Data Types
** BoardCell
   :PROPERTIES:
   :CUSTOM_ID: type-board-cell
   :END:
** Point
   :PROPERTIES:
   :CUSTOM_ID: type-point
   :END:
** Snake
   :PROPERTIES:
   :CUSTOM_ID: type-snake
   :END:

* Game Rules
** Objective

   BattleSnake is an adaptation of the classic video game "Snake", where the player
   maneuvers a snake around the play field to collect food pellets, which makes
   the snake grow longer. The main objective is to collect as much food as
   as possible, while avoiding hitting obstacles, such as walls and most
   importantly - your own snake.
   In BattleSnake, each round X number of snakes is pitted against each other,
   and the goal is to be the last snake left alive at the end of the round.

** You lose if your snake...
   - runs into another snake's body.
   - runs into its own body.
   - runs into the walls of the play field.
   - collides head-to-head with a longer snake (both die if they are of the same size).
   - starves.

** Starvation rules
   - Your snake starts out with 100 life and counts down by 1 each turn.
   - When your snake's life total reaches 0, it dies of starvation.

** Avoiding starvation
   - Food pellets spawn randomly around the play field.
   - Each food pellet increases your snake's length by 1 and resets its life to 100.

** Sportsmanship
   - No DDoSing your opponents.
   - No manual control of your snake.

** Turns
   Pellentesque dapibus suscipit ligula. Donec posuere augue in quam. Etiam vel
   tortor sodales tellus ultricies commodo. Suspendisse potenti. Aenean in sem ac
   leo mollis blandit. Donec neque quam, dignissim in, mollis nec, sagittis eu,
   wisi. Phasellus lacus. Etiam laoreet quam sed arcu. Phasellus at dui in ligula
   mollis ultricies. Integer placerat tristique nisl. Praesent augue. Fusce
   commodo. Vestibulum convallis, lorem a tempus semper, dui dui euismod elit,
   vitae placerat urna tortor vitae lacus. Nullam libero mauris, consequat quis,
   varius et, dictum id, arcu. Mauris mollis tincidunt felis. Aliquam feugiat
   tellus ut neque. Nulla facilisis, risus a rhoncus fermentum, tellus tellus
   lacinia purus, et dictum nunc justo sit amet elit.

** Growing longer
   Pellentesque dapibus suscipit ligula. Donec posuere augue in quam. Etiam vel
   tortor sodales tellus ultricies commodo. Suspendisse potenti. Aenean in sem ac
   leo mollis blandit. Donec neque quam, dignissim in, mollis nec, sagittis eu,
   wisi. Phasellus lacus. Etiam laoreet quam sed arcu. Phasellus at dui in ligula
   mollis ultricies. Integer placerat tristique nisl. Praesent augue. Fusce
   commodo. Vestibulum convallis, lorem a tempus semper, dui dui euismod elit,
   vitae placerat urna tortor vitae lacus. Nullam libero mauris, consequat quis,
   varius et, dictum id, arcu. Mauris mollis tincidunt felis. Aliquam feugiat
   tellus ut neque. Nulla facilisis, risus a rhoncus fermentum, tellus tellus
   lacinia purus, et dictum nunc justo sit amet elit.

**  Death
*** Walls
*** Collision
*** Starvation

* General Advice
  coming soon...
* Deploying Your Snake
  coming soon...
* Example Snakes
  more coming soon...
** Ruby Snake
   [[https://github.com/Stembolthq/battle_snake/blob/v2.0.0/examples/ruby_snake/ruby_snake.rb][Ruby Snake]]

* Footnotes

[fn:2] https://en.wikipedia.org/wiki/Universally_unique_identifier#Collisions

[fn:1] http://www.sinatrarb.com/intro.html

# Local Variables:
# org-twbs-table-default-attributes: (:class "table")
# End:
